{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["สวัสดี", "หวัดดี", "เฮลโหล", "ขอสอบถามหน่อย"],
      "responses": [
        "สวัสดีค่ะ เทศบาลยินดีให้บริการ มีเรื่องอะไรให้ช่วยคะ?",
        "สวัสดีครับ สามารถสอบถามหรือแจ้งเรื่องร้องเรียนได้เลยครับ"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["ขอบคุณ", "ลาก่อน", "บ๊ายบาย", "ไม่มีแล้ว"],
      "responses": [
        "ขอบคุณที่ใช้บริการเทศบาลค่ะ",
        "หากมีปัญหาเพิ่มเติม สามารถติดต่อมาได้เสมอนะคะ"
      ]
    },
    {
      "tag": "municipality_services",
      "patterns": [
        "เทศบาลรับเรื่องอะไรบ้าง",
        "สามารถแจ้งเรื่องอะไรได้บ้าง",
        "เทศบาลช่วยอะไรได้"
      ],
      "responses": [
        "เทศบาลรับแจ้งเรื่องร้องเรียน เช่น ถนนชำรุด ไฟฟ้าสาธารณะ น้ำเสีย ขยะ สุนัขจรจัด และปัญหาด้านสิ่งแวดล้อมค่ะ"
      ]
    },
    {
      "tag": "complaint_process",
      "patterns": [
        "จะแจ้งเรื่องร้องเรียนยังไง",
        "ต้องทำยังไงถึงจะแจ้งเรื่องได้",
        "ขั้นตอนการร้องเรียน"
      ],
      "responses": [
        "คุณสามารถพิมพ์รายละเอียดปัญหา สถานที่ และแนบรูป (ถ้ามี) ทางแชทนี้ได้เลยค่ะ ระบบจะส่งเรื่องให้กองที่เกี่ยวข้อง"
      ]
    },
    {
      "tag": "municipality_departments",
      "patterns": [
        "เทศบาลมีกี่กอง",
        "มีกองอะไรบ้าง",
        "โครงสร้างเทศบาลเป็นยังไง"
      ],
      "responses": [
        "เทศบาลประกอบด้วยหลายกอง เช่น กองช่าง กองสาธารณสุข กองคลัง กองการศึกษา และสำนักปลัดเทศบาลค่ะ"
      ]
    },
    {
      "tag": "engineering_department",
      "patterns": [
        "กองช่างดูแลอะไร",
        "ถนนพังต้องแจ้งกองไหน",
        "ไฟถนนไม่ติด"
      ],
      "responses": [
        "กองช่างดูแลเรื่องถนน ทางเท้า ระบบระบายน้ำ และไฟฟ้าสาธารณะค่ะ"
      ]
    },
    {
      "tag": "public_health_department",
      "patterns": [
        "ขยะล้น",
        "น้ำเสีย",
        "กลิ่นเหม็น",
        "สุนัขจรจัด"
      ],
      "responses": [
        "ปัญหาด้านขยะ น้ำเสีย กลิ่นรบกวน และสัตว์จรจัด อยู่ในความดูแลของกองสาธารณสุขค่ะ"
      ]
    },
    {
      "tag": "education_department",
      "patterns": [
        "ศูนย์เด็กเล็ก",
        "โรงเรียนเทศบาล",
        "การศึกษาของเทศบาล"
      ],
      "responses": [
        "กองการศึกษาดูแลศูนย์พัฒนาเด็กเล็ก โรงเรียนในสังกัด และกิจกรรมด้านการศึกษาค่ะ"
      ]
    },
    {
      "tag": "finance_department",
      "patterns": [
        "ภาษี",
        "ค่าธรรมเนียม",
        "การชำระภาษี"
      ],
      "responses": [
        "กองคลังดูแลเรื่องภาษี ค่าธรรมเนียม และการเงินของเทศบาลค่ะ"
      ]
    },
    {
      "tag": "complaint_followup",
      "patterns": [
        "ติดตามเรื่องร้องเรียน",
        "เรื่องที่แจ้งไปถึงไหนแล้ว",
        "เช็คสถานะเรื่องร้องเรียน"
      ],
      "responses": [
        "กรุณาแจ้งเลขรับเรื่องหรือรายละเอียดที่เคยแจ้งไว้ ระบบจะช่วยตรวจสอบสถานะให้ค่ะ"
      ]
    }
  ]
}
